# GetDataType Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
Definition..::..GetDataType Method
Definition Class See Also
---
Gets a ForgeTypeId identifying the data type describing values of the parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ForgeTypeId GetDataType()
```

Visual Basic
---
```text
Public Function GetDataType As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetDataType()
```

# ### Return Value
A ForgeTypeId identifying the data type of the parameter.
# Remarks
The returned ForgeTypeId may identify either a spec or a category. When it is a category, it indicates a Family Type parameter of that category. See Parameter.IsSpec(ForgeTypeId), UnitUtils.IsMeasurableSpec(ForgeTypeId), Category.IsBuiltInCategory(ForgeTypeId), and Parameter.IsValidDataType(ForgeTypeId).
# See Also
Definition Class
Autodesk.Revit.DB Namespace